Project/Toir/src/Reports/гкс_СреднемесячноеЗначениеКПЭ/гкс_СреднемесячноеЗначениеКПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>гкс_СреднемесячноеЗначениеКПЭ</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/торо_ЦелевыеЗначенияKPI/торо_ЦелевыеЗначенияKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЦелевыеЗначенияKPI</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КритическоеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПО</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.торо_ПоказателиKPI</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/гкс_РегистрацияЗначенийВнешнихПоказателей/гкс_РегистрацияЗначенийВнешнихПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РегистрацияЗначенийВнешнихПоказателей</name>
  <attributes>
    <name>ДатаНедели</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭффективностьРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнениеПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>ТипРабот</name>
      <type>
        <types>EnumRef.гкс_ТипыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД_Ремонта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗавершенВовремя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланВНужномПериоде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ОбъектыРемонта</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АдресМестонахождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетСерийныхЗапчастей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <comment>Организация-изготовитель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКОФ</name>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИсполнительРемонта</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекСтатусВУчете</name>
    <type>
      <types>EnumRef.торо_СтатусыОРВУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАктив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонтаПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеРемонта</name>
    <type>
      <types>EnumRef.торо_УсловияРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>14</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>14</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияОбслуживания</name>
    <type>
      <types>CatalogRef.торо_СтратегииОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.торо_ТипыОбъектовRCM</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КатегорияРиска</name>
    <type>
      <types>CatalogRef.торо_КатегорииРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КомментарийМатрицы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОсновноеСредство</name>
    <comment>TOIR20-222</comment>
    <type>
      <types>CatalogRef.гкс_ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_МетодПланированияТоир</name>
    <type>
      <types>EnumRef.гкс_МетодыПланированияТоир</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КачественнаяОценка</name>
    <type>
      <types>EnumRef.гкс_КачественнаяОценкаКритичности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_ВыборИзМатрицы</name>
    <attributes>
      <name>ОбъектВоздействия</name>
      <type>
        <types>CatalogRef.торо_ОбъектыВоздействия</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияРиска</name>
      <type>
        <types>CatalogRef.торо_КатегорииРиска</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Reports/гкс_СреднемесячноеЗначениеКПЭ/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ДатаНачала = НачалоГода(ТекущаяДата());
	ДатаОкончания = КонецГода(ТекущаяДата());
	Организация = Неопределено;
	
	ПараметрНачала = Новый ПараметрКомпоновкиДанных("ДатаНачала");
	ПараметрОкончания = Новый ПараметрКомпоновкиДанных("ДатаОкончания");
	ПараметрМесяцОтбора = Новый ПараметрКомпоновкиДанных("МесяцОтбора");
	ПараметрОрганизация = Новый ПараметрКомпоновкиДанных("Организация");
	
	Для Каждого СМ Из Настройки.ПараметрыДанных.Элементы Цикл
		Если СМ.Использование = Истина Тогда
			Если СМ.Параметр = ПараметрМесяцОтбора Тогда 
				ДатаНачала = НачалоМесяца(СМ.Значение.Дата);
				ДатаОкончания = КонецМесяца(СМ.Значение.Дата);
			КонецЕсли;
			Если СМ.Параметр = ПараметрОрганизация Тогда 
				Организация = СМ.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	ВнешниеНаборыДанных = Новый Структура;
	ТЧРезультат = ПолучитьТаблицуДанных(ДатаНачала, ДатаОкончания, Организация);
	ВнешниеНаборыДанных.Вставить("ВТ_Данные", ТЧРезультат);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОсновнойСхемы, ДанныеРасшифровки);	
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВыводаВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаВТабличныйДокумент.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВыводаВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

Функция ПолучитьТаблицуДанных(ДатаНачала, ДатаОкончания, Организация)
	
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКПИ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТЧ_Результат = Новый ТаблицаЗначений();
	ТЧ_Результат.Колонки.Добавить("ПроцентКПИ", Новый ОписаниеТипов("Число",,, 
		Новый КвалификаторыЧисла(15,2)));
		ТЧ_Результат.Колонки.Добавить("ПорядокКолонки", Новый ОписаниеТипов("Число",,, 
		Новый КвалификаторыЧисла(10)));
	ТЧ_Результат.Колонки.Добавить("КлючевыеПоказатели", Новый ОписаниеТипов("Строка",,,,
		Новый КвалификаторыСтроки(50)));
	ТЧ_Результат.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка",,,,
		Новый КвалификаторыСтроки(50)));

	Пока ВыборкаКПИ.Следующий() Цикл
		СуммаПроцент = 0;
		Количество = 0;
		Выборка = ВыборкаКПИ.Выбрать();
		Пока Выборка.Следующий() Цикл
			НС = ТЧ_Результат.Добавить();
			НС.КлючевыеПоказатели = ВыборкаКПИ.КлючевыеПоказатели;
			НС.ИмяКолонки = НеделяГода(Выборка.ДатаНедели);
			НС.ПорядокКолонки = НеделяГода(Выборка.ДатаНедели);
			НС.ПроцентКПИ = Выборка.Процент;
			СуммаПроцент = СуммаПроцент + Выборка.Процент;
			Количество = Количество + 1;
		КонецЦикла;
		СреднееЗаМесяц = СуммаПроцент / Количество;
		//
		НС = ТЧ_Результат.Добавить();
		НС.КлючевыеПоказатели = ВыборкаКПИ.КлючевыеПоказатели;
		НС.ИмяКолонки = "Цель";
		НС.ПроцентКПИ = ВыборкаКПИ.Цель;
		НС.ПорядокКолонки = 9997;
		//
		НС = ТЧ_Результат.Добавить();
		НС.КлючевыеПоказатели = ВыборкаКПИ.КлючевыеПоказатели;
		НС.ИмяКолонки = "Отклонение";
		НС.ПроцентКПИ = СреднееЗаМесяц - ВыборкаКПИ.Цель;
		НС.ПорядокКолонки = 9998;
		//
		НС = ТЧ_Результат.Добавить();
		НС.КлючевыеПоказатели = ВыборкаКПИ.КлючевыеПоказатели;
		НС.ИмяКолонки = "Среднее за месяц";
		НС.ПроцентКПИ = СреднееЗаМесяц;
		НС.ПорядокКолонки = 9999;
	КонецЦикла;
	
	Возврат ТЧ_Результат;
КонецФункции

Функция ПолучитьТекстЗапроса()
	Возврат "ВЫБРАТЬ
	        |	ВЫБОР
	        |		КОГДА ТЧ.ЗавершенВовремя
	        |			ТОГДА ТЧ.ВремяРаботы
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК ВремяРаботы,
	        |	ВЫБОР
	        |		КОГДА ТЧ.ЗавершенВовремя
	        |				И ТЧ.ПланВНужномПериоде
	        |			ТОГДА ТЧ.ВремяРаботы
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК ВремяРаботы2,
	        |	ТЧ.Ссылка.ДатаНедели КАК ДатаНедели,
	        |	ТЧ.ВремяРаботыПлан КАК ВремяРаботыПлан,
	        |	ТЧ.ИД_Ремонта КАК ИД_Ремонта,
	        |	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
	        |	ТЧ.ТипРабот КАК ТипРабот,
	        |	ТЧ.Ссылка.ВремяРаботыПлан КАК ВесьПлан,
	        |	ТЧ.ОбъектРемонта.Подразделение КАК Подразделение,
	        |	ЕСТЬNULL(ТЧ.ОбъектРемонта.Направление.гкс_Служба, """") КАК Служба,
	        |	ТЧ.Ссылка.Организация КАК Организация,
	        |	ТЧ.ПланВНужномПериоде КАК ПланВНужномПериоде,
	        |	ТЧ.ЗавершенВовремя КАК ЗавершенВовремя
	        |ПОМЕСТИТЬ ДанныеПериода
	        |ИЗ
	        |	Документ.гкс_РегистрацияЗначенийВнешнихПоказателей.Показатели КАК ТЧ
	        |ГДЕ
	        |	ТЧ.Ссылка.ДатаНедели >= &ДатаНачала
	        |	И ТЧ.Ссылка.ДатаНедели < &ДатаОкончания
	        |	И ТЧ.Ссылка.Проведен
	        |	И ТЧ.Ссылка.Организация = &Организация
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеПериода.Организация КАК Организация,
	        |	СУММА(ДанныеПериода.ВремяРаботыПлан) КАК ВремяРаботыПлан,
	        |	СУММА(ДанныеПериода.ВремяРаботы) КАК ВремяРаботыФакт,
	        |	ДанныеПериода.ДатаНедели КАК ДатаНедели
	        |ПОМЕСТИТЬ ВесьПланОрганизации
	        |ИЗ
	        |	ДанныеПериода КАК ДанныеПериода
	        |ГДЕ
	        |	ДанныеПериода.ЗавершенВовремя
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДанныеПериода.Организация,
	        |	ДанныеПериода.ДатаНедели
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеПериода.Организация КАК Организация,
	        |	СУММА(ДанныеПериода.ВремяРаботыПлан) КАК ВремяРаботыПлан,
	        |	СУММА(ДанныеПериода.ВремяРаботы2) КАК ВремяРаботы2Факт,
	        |	ДанныеПериода.ДатаНедели КАК ДатаНедели
	        |ПОМЕСТИТЬ ВесьПланОрганизации2
	        |ИЗ
	        |	ДанныеПериода КАК ДанныеПериода
	        |ГДЕ
	        |	ДанныеПериода.ПланВНужномПериоде
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДанныеПериода.Организация,
	        |	ДанныеПериода.ДатаНедели
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеПериода.ОбъектРемонта КАК ОбъектРемонта,
	        |	ДанныеПериода.Организация КАК Организация,
	        |	ДанныеПериода.Подразделение КАК Подразделение,
	        |	ДанныеПериода.Служба КАК Служба,
	        |	ДанныеПериода.ТипРабот КАК ТипРабот,
	        |	ДанныеПериода.ИД_Ремонта КАК ИД_Ремонта,
	        |	""Эффективность планирования работ"" КАК КлючевыеПоказатели,
	        |	ВЫБОР
	        |		КОГДА ВесьПланОрганизации.ВремяРаботыПлан = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ДанныеПериода.ВремяРаботы / ВесьПланОрганизации.ВремяРаботыПлан * 100
	        |	КОНЕЦ КАК ПроцентКПИ,
	        |	ДанныеПериода.ДатаНедели КАК ДатаНедели,
	        |	РегЦель.Значение КАК Цель
	        |ПОМЕСТИТЬ СуммаРезультат
	        |ИЗ
	        |	ДанныеПериода КАК ДанныеПериода
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВесьПланОрганизации КАК ВесьПланОрганизации
	        |		ПО ДанныеПериода.Организация = ВесьПланОрганизации.Организация
	        |			И (ДанныеПериода.ЗавершенВовремя)
	        |			И (ВесьПланОрганизации.ДатаНедели = ДанныеПериода.ДатаНедели)
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЦелевыеЗначенияKPI.СрезПоследних(
	        |				&ДатаОкончания,
	        |				Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	        |					И ОбъектРемонта = ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)) КАК РегЦель
	        |		ПО ДанныеПериода.Организация = РегЦель.Организация
	        |			И (РегЦель.Показатель.Наименование = ""Эффективность планирования работ"")
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ДанныеПериода.ОбъектРемонта,
	        |	ДанныеПериода.Организация,
	        |	ДанныеПериода.Подразделение,
	        |	ДанныеПериода.Служба,
	        |	ДанныеПериода.ТипРабот,
	        |	ДанныеПериода.ИД_Ремонта,
	        |	""Выполнение плана"",
	        |	ВЫБОР
	        |		КОГДА ВесьПланОрганизации2.ВремяРаботыПлан = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ДанныеПериода.ВремяРаботы2 / ВесьПланОрганизации2.ВремяРаботыПлан * 100
	        |	КОНЕЦ,
	        |	ДанныеПериода.ДатаНедели,
	        |	РегЦель.Значение
	        |ИЗ
	        |	ДанныеПериода КАК ДанныеПериода
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВесьПланОрганизации2 КАК ВесьПланОрганизации2
	        |		ПО ДанныеПериода.Организация = ВесьПланОрганизации2.Организация
	        |			И (ДанныеПериода.ПланВНужномПериоде)
	        |			И ДанныеПериода.ДатаНедели = ВесьПланОрганизации2.ДатаНедели
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЦелевыеЗначенияKPI.СрезПоследних(
	        |				&ДатаОкончания,
	        |				Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	        |					И ОбъектРемонта = ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)) КАК РегЦель
	        |		ПО ДанныеПериода.Организация = РегЦель.Организация
	        |			И (РегЦель.Показатель.Наименование = ""Выполнение плана"")
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ДанныеПериода.ОбъектРемонта,
	        |	ДанныеПериода.Организация,
	        |	ДанныеПериода.Подразделение,
	        |	ДанныеПериода.Служба,
	        |	ДанныеПериода.ТипРабот,
	        |	ДанныеПериода.ИД_Ремонта,
	        |	""Эффективность исполнения работ"",
	        |	ВЫБОР
	        |		КОГДА ВесьПланОрганизации.ВремяРаботыФакт = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ДанныеПериода.ВремяРаботыПлан / ВесьПланОрганизации.ВремяРаботыФакт * 100
	        |	КОНЕЦ,
	        |	ДанныеПериода.ДатаНедели,
	        |	РегЦель.Значение
	        |ИЗ
	        |	ДанныеПериода КАК ДанныеПериода
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВесьПланОрганизации КАК ВесьПланОрганизации
	        |		ПО ДанныеПериода.Организация = ВесьПланОрганизации.Организация
	        |			И (ДанныеПериода.ЗавершенВовремя)
	        |			И ДанныеПериода.ДатаНедели = ВесьПланОрганизации.ДатаНедели
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЦелевыеЗначенияKPI.СрезПоследних(
	        |				&ДатаОкончания,
	        |				Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	        |					И ОбъектРемонта = ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)) КАК РегЦель
	        |		ПО ДанныеПериода.Организация = РегЦель.Организация
	        |			И (РегЦель.Показатель.Наименование = ""Эффективность исполнения работ"")
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СуммаРезультат.КлючевыеПоказатели КАК КлючевыеПоказатели,
	        |	СУММА(ЕСТЬNULL(СуммаРезультат.ПроцентКПИ, 0)) КАК Процент,
	        |	СуммаРезультат.ДатаНедели КАК ДатаНедели,
	        |	МАКСИМУМ(ЕСТЬNULL(СуммаРезультат.Цель, 0)) КАК Цель
	        |ИЗ
	        |	СуммаРезультат КАК СуммаРезультат
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СуммаРезультат.КлючевыеПоказатели,
	        |	СуммаРезультат.ДатаНедели
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ДатаНедели
	        |ИТОГИ
	        |	МАКСИМУМ(Цель)
	        |ПО
	        |	КлючевыеПоказатели";
КонецФункции
